<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>История - LudumLabs</title>
    <link rel="stylesheet" href="style.css">
    <link href="https://fonts.googleapis.com/css2?family=Jost:ital,wght@0,100..900;1,100..900&family=Orbitron:wght@400..900&family=Unbounded:wght@200..900&display=swap" rel="stylesheet">
</head>
<body>
    <?php include 'navbar.php'; ?>

    <section class="history-section">
        <h2>История компьютерных игр</h2>
        <p>Погрузитесь в увлекательное путешествие по истории видеоигр, от их появления до современности.</p>

        <div class="history-content">
            <div class="history-text">
                <h3>Ранние годы</h3>
                <p>Компьютерные игры появились в 1950-х годах, когда были созданы первые интерактивные программы. В 1952 году, например, появилась игра "OXO", которая была подобием крестиков-ноликов на экране компьютера. Но настоящая революция в индустрии видеоигр произошла в начале 1970-х годов с выпуском аркадной игры Pong от Atari.</p>
                <hr class="history-line">

                <h3>Золотая эра аркадных игр</h3>
                <p>1970-е и 1980-е годы стали золотым временем для аркадных игр. Игры как Space Invaders, Pac-Man и Donkey Kong заняли места в игровых автоматах по всему миру. Аркады стали невероятно популярными, а игры на этих устройствах привлекали игроков своим инновационным геймплеем и графикой.</p>
                <hr class="history-line">

                <h3>Революция домашних консолей</h3>
                <p>С развитием персональных компьютеров и домашних игровых консолей, таких как Atari 2600 и Nintendo Entertainment System (NES), видеоигры стали доступны в домах людей. В этот период игры стали более разнообразными, с более сложными мирами и сюжетами, а также улучшенной графикой.</p>
                <hr class="history-line">

                <h3>Современные игры</h3>
                <p>Современные видеоигры представляют собой сложные произведения искусства с потрясающей графикой, захватывающими мирами и многопользовательскими режимами. Видеоигры прошли путь от простых аркадных игр до высокобюджетных блокбастеров, таких как The Witcher 3, Red Dead Redemption 2 и Fortnite, которые собирают миллионы игроков по всему миру.</p>
                <hr class="history-line">

                <h3>Будущее видеоигр</h3>
                <p>Будущее видеоигр обещает быть захватывающим. Развитие виртуальной и дополненной реальности, улучшение искусственного интеллекта и графических технологий позволят создавать еще более захватывающие и реалистичные игровые миры. Вполне возможно, что в ближайшие годы игры станут еще более интерактивными, с использованием новых технологий и платформ.</p>
            </div>
            <div class="history-image">
                <img src="images/3.png" alt="История видеоигр">
            </div>
        </div>
    </section>

    <?php include 'footer.php'; ?>
</body>
</html>
